# things for brew
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
brew "mas"
brew "zsh"


# utils
brew "ripgrep"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "wget"
brew "zip"
brew "exa"
brew "fpp"
brew "cloc"
brew "tree"
brew "gotop"
brew "fzf"
brew "timewarrior"
brew "yq"
brew "reattach-to-user-namespace"
brew "devutils"
brew "act"
brew "tfenv"
brew "gnu-sed"
brew "ossp-uuid"
brew "git-filter-repo"

# fonts and themes
cask "font-fira-code-nerd-font"

# k8s
brew "kubernetes-cli"
brew "kustomize"
brew "k9s"
brew "stern"
brew "minikube"
brew "kind"
tap "fluxcd/tap"
brew "fluxcd/tap/flux"
tap "omrikiei/ktunnel" 
brew "omrikiei/ktunnel/ktunnel"
brew "kubeconform"

# aws
brew "awscli"
brew "aws-rotate-key"

# git
brew "git"
brew "git-lfs"
brew "gh"
brew "tig"

# secret & password  management
brew "sops"
brew "gnupg"
cask "keepassxc"
cask "bitwarden"
brew "pinentry-mac"

# editor and terminal etc.
brew "neovim"
brew "tmux"
cask "kitty"
cask "visual-studio-code"
cask "datagrip"
cask "goland"
brew "starship"
cask "anaconda"


# os applications
cask "rectangle"
brew "graphviz"
cask "openvpn-connect"
mas "Harvest", id: 506189836
mas "Jira Cloud by Atlassian", id: 1475897096
cask "discord"
cask "slack"
cask "whatsapp"
cask "postman"
cask "vlc"
mas "1Password 7 - Password manager", id: 1333542190

# for mood
cask "spotify"
cask "tidal"
